export const CheckAutoSection = () => {
  return (
    <section className="section section-hero">
      <div
        className="hero-box"
        style={{
          position: 'relative',
          backgroundImage: 'url(/img/hero-background.jpg)',
          backgroundPosition: '50% 40%',
        }}
      >
        <div className="container">
          <div className="hero-text align-center">
            <h1>Проверка пробега авто из Кореи</h1>
            <p>по VIN номеру</p>
          </div>

          <form className="destinations-form">
            <div className="input-line">
              <input
                id="VIN"
                type="text"
                name="destination"
                className="form-input check-value bg-white"
                maxLength={17}
                placeholder="KNAP6815GJK504750"
              />
              <button
                id="checkButton"
                type="button"
                name="destination-submit"
                className="form-submit btn btn-special"
              >
                Начать проверку
              </button>
            </div>
          </form>
        </div>
      </div>

      <div id="carinfo" className="container invisible info-animated">
        <div id="toast">Ссылка скопирована!</div>
        <div className="statistics-box">
          <div className="show-damage hide">
            <span></span>
          </div>

          <div className="share-result">
            <svg width="24" height="24">
              <path
                opacity="0.8"
                d="M13.1 14.9961V6.86151L14.7489 8.51037C15.1723 8.93384 15.8589 8.93384 16.2824 8.51037C16.7059 8.08689 16.7059 7.4003 16.2824 6.97683L13.193 3.88744C13.0032 3.69767 12.8299 3.55215 12.6403 3.45489C12.4487 3.35655 12.2456 3.31016 12 3.31016C11.7531 3.31016 11.5461 3.36092 11.3501 3.46399C11.1563 3.56593 10.9775 3.71691 10.784 3.91044L7.71761 6.97683C7.29413 7.4003 7.29413 8.08689 7.71761 8.51037C8.14108 8.93384 8.82767 8.93384 9.25114 8.51037L10.9 6.86151V14.9961C10.9 15.6079 11.3991 16.1021 12.0108 16.0961C12.6141 16.0901 13.1 15.5994 13.1 14.9961ZM5.1 17.9007V13.0007C5.1 12.3932 4.60751 11.9007 4 11.9007C3.39249 11.9007 2.9 12.3932 2.9 13.0007V19.0007C2.9 19.6083 3.39249 20.1007 4 20.1007H20C20.6075 20.1007 21.1 19.6083 21.1 19.0007V13.0007C21.1 12.3932 20.6075 11.9007 20 11.9007C19.3925 11.9007 18.9 12.3932 18.9 13.0007V17.9007H5.1Z"
                stroke-width="0.2"
              ></path>
            </svg>
          </div>
          {/* 
          <!--<div className="show-photo hide"><svg width="24" height="21"><path xmlns="http://www.w3.org/2000/svg" d="m21.411228,3.612984l-3.377441,0l-1.763261,-2.937544l-8.812632,0l-1.762526,2.937544l-3.378176,0c-0.734386,0 -2.203158,0.734386 -2.203158,2.180392l0,11.772942c0,1.216878 1.101579,2.203158 2.050406,2.203158l19.293055,0c0.964249,0 2.157626,-1.032547 2.157626,-2.179658l0,-11.773677c0,-0.734386 -0.734386,-2.203158 -2.203158,-2.203158l-0.000734,0l-0.000001,0.000001zm0.734386,13.976835c0,0.290082 -0.469273,0.695464 -0.68812,0.71162l-19.288649,0c-0.170378,-0.013953 -0.585306,-0.345161 -0.585306,-0.734386l0,-11.772942c0,-0.465601 0.624963,-0.69987 0.734386,-0.71162l4.209501,0l1.762526,-2.937544l7.198452,0l1.310879,2.22519l0.403912,0.712354l4.208766,0c0.517742,0 0.727042,0.67637 0.734386,0.734386l0,11.773677l-0.000734,-0.000734l0.000001,-0.000001zm-10.281404,-11.773677c-2.839136,0 -5.140702,2.301566 -5.140702,5.140702s2.301566,5.140702 5.140702,5.140702s5.140702,-2.301566 5.140702,-5.140702s-2.301566,-5.140702 -5.140702,-5.140702zm0,8.812632c-2.024702,0 -3.67193,-1.647228 -3.67193,-3.67193s1.647228,-3.67193 3.67193,-3.67193s3.67193,1.647228 3.67193,3.67193s-1.647228,3.67193 -3.67193,3.67193z" id="svg_1" stroke="null"></path></svg><span style={{
            margin: '0px 5px',
          }}>Смотреть фото</span></div>--> */}

          <div className="buttom-buttons">
            <div className="show-photo hide">
              <svg width="24" height="21">
                <path
                  xmlns="http://www.w3.org/2000/svg"
                  d="m21.411228,3.612984l-3.377441,0l-1.763261,-2.937544l-8.812632,0l-1.762526,2.937544l-3.378176,0c-0.734386,0 -2.203158,0.734386 -2.203158,2.180392l0,11.772942c0,1.216878 1.101579,2.203158 2.050406,2.203158l19.293055,0c0.964249,0 2.157626,-1.032547 2.157626,-2.179658l0,-11.773677c0,-0.734386 -0.734386,-2.203158 -2.203158,-2.203158l-0.000734,0l-0.000001,0.000001zm0.734386,13.976835c0,0.290082 -0.469273,0.695464 -0.68812,0.71162l-19.288649,0c-0.170378,-0.013953 -0.585306,-0.345161 -0.585306,-0.734386l0,-11.772942c0,-0.465601 0.624963,-0.69987 0.734386,-0.71162l4.209501,0l1.762526,-2.937544l7.198452,0l1.310879,2.22519l0.403912,0.712354l4.208766,0c0.517742,0 0.727042,0.67637 0.734386,0.734386l0,11.773677l-0.000734,-0.000734l0.000001,-0.000001zm-10.281404,-11.773677c-2.839136,0 -5.140702,2.301566 -5.140702,5.140702s2.301566,5.140702 5.140702,5.140702s5.140702,-2.301566 5.140702,-5.140702s-2.301566,-5.140702 -5.140702,-5.140702zm0,8.812632c-2.024702,0 -3.67193,-1.647228 -3.67193,-3.67193s1.647228,-3.67193 3.67193,-3.67193s3.67193,1.647228 3.67193,3.67193s-1.647228,3.67193 -3.67193,3.67193z"
                  id="svg_1"
                  stroke="null"
                ></path>
              </svg>
              <span>Смотреть фото</span>
            </div>
            <div className="show-report experement">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                version="1.0"
                width="21"
                height="19"
                preserveAspectRatio="xMidYMid meet"
                viewBox="0 0 512.000000 512.000000"
              >
                <g
                  transform="translate(0.000000,512.000000) scale(0.100000,-0.100000)"
                  fill="#000000"
                  stroke="none"
                >
                  <path d="M891 5109 c-25 -5 -78 -24 -119 -44 -145 -69 -256 -216 -281 -376 -15 -89 -15 -4169 0 -4258 33 -206 206 -383 410 -421 37 -7 604 -9 1695 -8 l1639 3 60 24 c178 71 306 224 334 401 7 43 11 579 11 1610 0 1490 -1 1546 -19 1585 -24 50 -1442 1469 -1484 1485 -35 13 -2180 12 -2246 -1z m2029 -941 c0 -618 0 -633 21 -674 12 -26 36 -53 57 -66 l37 -23 643 -3 642 -3 -2 -1467 c-3 -1466 -3 -1467 -24 -1507 -11 -22 -40 -53 -63 -70 l-43 -30 -1615 -3 c-1565 -2 -1616 -2 -1657 17 -47 20 -87 66 -105 120 -16 49 -16 4153 0 4202 18 53 58 99 103 120 39 18 86 19 1024 19 l982 0 0 -632z m750 -23 l425 -425 -428 0 -427 0 0 425 c0 234 1 425 3 425 1 0 193 -191 427 -425z"></path>
                  <path d="M1502 2603 c-49 -24 -75 -68 -80 -132 -4 -62 17 -105 71 -145 28 -21 29 -21 1067 -21 1038 0 1039 0 1067 21 94 69 99 198 10 265 l-32 24 -1035 2 c-938 2 -1038 1 -1068 -14z"></path>
                  <path d="M1515 1516 c-16 -8 -43 -28 -60 -45 -27 -29 -30 -38 -30 -101 0 -63 3 -72 30 -101 59 -62 0 -59 1105 -59 1104 0 1046 -3 1104 59 24 25 30 42 34 88 3 48 0 64 -20 92 -12 19 -36 44 -51 55 -28 21 -31 21 -1055 23 -843 2 -1032 0 -1057 -11z"></path>
                </g>
              </svg>
              <span>Полный отчет за 3 минуты</span>
              {/* <!--<span>Получить полный отчет</span>--> */}
              {/* <!--<span>Узнать больше в отчете</span>--> */}
            </div>
          </div>

          {/* <!--<div className="statistics-item">
                          <span className="value" id="M_CHASSIS_NO">
                              
                          </span>
                          <p className="title">
                              Идентификатор
                          </p>
                      </div>--> */}
          <div className="statistics-item">
            <span className="value" id="M_TRADEMARK_OF_VEHICLE"></span>
            <p className="title">Наименование модели</p>
          </div>
          <div className="statistics-item">
            <span className="value" id="M_COLOR_ENG"></span>
            <p className="title">Цвет автомобиля</p>
          </div>
          <div className="statistics-item">
            <span className="value" id="M_EXPORT_PERMIT_DATE"></span>
            <p className="title">Дата вывоза из Кореи</p>
          </div>

          <div className="statistics-item">
            <span className="value" id="M_DATE_OF_FIRST_REGISTRATION"></span>
            <p className="title">Начало эксплуатации</p>
          </div>

          <div className="statistics-item">
            <span className="value" id="M_FINAL_DRIVE_DISTANCE"></span>
            <p className="title">Пробег при вывозе</p>
          </div>
        </div>
      </div>
      <div id="images" className="fotorama" data-nav="thumbs" data-allowfullscreen="true"></div>
    </section>
  )
}
